s = int(input())
units = ["один", "два", "три", "четыре", "пять", "шесть",
         "семь", "восемь", "девять", "десять", "одиннадцать", "двенадцать",
         "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать",
         "семнадцать", "восемнадцать", "девятнадцать"]
tens = ["двадцать", "тридцать", "сорок", "пятьдесят",
        "шестьдесят", "семьдесят", "восемьдесят", "девяносто"]
hundreds = ["сто", "двести", "триста", "четыреста", "пятьсот",
            "шестьсот", "семьсот", "восемьсот", "девятьсот"]

text = ''
if s // 100 > 0:
    text += hundreds[(s // 100) - 1] + " "
    s %= 100
if s // 10 > 1:
    text += tens[(s // 10) - 2] + " "
    s %= 10
if s > 0:
    text += units[s-1]
print(text)
